namespace Library
{

    /*У компонента должен быть публичный метод, который должен 
принимать на вход имя файла (включая путь до файла), название 
документа (заголовок в документе), информацию по ширине 
каждого столбца и высоте каждой строки (по строке задается для 
шапки и для остальных строк), заголовки для шапки и данные 
для таблицы. Строки и столбцы таблицы считать с 0 позиции. 
Данные должны передаваться в виде набора объектов какого-то 
класса. 
        
        Таблица должна заполнятся по принципу: каждая строка 
– это запись класса из набора, ячейка строки заполняется из 
свойства/поля объекта класса (в настройках указывать для какого 
столбца какое свойство/поле соответствует) 
        
        Первая ячейка 
строки (относящаяся к шапке) заполняется также из записи 
класса из набора. 
        
        Должна быть проверка на заполненность 
входных данных значениями. 
        
        Должна быть проверка, что все 
ячейки шапки заполнены и для каждого столбца известно 
свойство/поле класса из которого для него следует брать 
значение.
*/

    public class SecondTableComponent
    {

        public void SaveTable() {
        
        }

    }
}
